config.org
#+TITLE: Chu's Literate DOOM GNU Emacs Configuration
#+AUTHOR: Chu the Pup
#+DESCRIPTION: Chu's Literate Doom GNU Emacs configuration
#+PROPERTY: header-args :tangle yes
#+startup: content
* Org Mode Literate Config (config.org) file

** Preamble

Here's the deets:

*** Org-mode babel tangle setup

There is a property defined on at the top of this file:

#+begin_example emacs-lisp
header-args :tangle yes
#+end_example

This tells emacs to automatically tangle (include) all code blocks in this file when generating the code for the config file (config.el), unless the code block explicitly includes =:tangle no= as the above code block does (or if it is a quote or example block).

*** Usage of quote and example blocks

This is done in order to debug the configuration on my end. However, the use of quote and example blocks also serves as a way of offering an on/off switch to certain blocks of "settings" (blocks beginning in "#+begin_something" and ending in "#+end_something").

** DOOM Emacs stuff

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:

+ `doom-font'

+ `doom-variable-pitch-font'

+ `doom-big-font' -- used for `doom-big-font-mode'; use this for presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font string. You generally only need these two:

#+begin_example
(setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
#+end_example

#+begin_example
(setq doom-variable-pitch-font (font-spec :family "sans" :size 13))
#+end_example

There are two ways to load a theme. Both assume the theme is installed and available. You can either set `doom-theme' or manually load a theme with the `load-theme' function. This is the default:

#+begin_example emacs-lisp
(setq doom-theme 'doom-one)
#+end_example

Here are some additional functions/macros that could help you configure Doom:

- `load!' for loading external *.el files relative to this one

- `use-package!' for configuring packages

- `after!' for running code after a package has loaded

- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.

- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over the highlighted symbol at press 'K' (non-evil users must press 'C-c c k'). This will open documentation for it, including demos of how they are used.

You can also try 'gd' (or 'C-c c d') to jump to their definition and see how they are implemented.

Place your private configuration here! Remember, you do not need to run 'doom sync' after modifying this file!

Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.

#+begin_example emacs-lisp
(setq user-full-name "John Doe"
      user-mail-address "example@donut.arpa")
#+end_example
** My Config
*** Private Configuration
#+begin_src emacs-lisp
(setq user-full-name "Chu the Pup"
      user-mail-address "chufilthymutt@gmail.com")
#+end_src
*** EMMS
#+begin_src emacs-lisp
(setq emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
#+end_src

#+begin_src emacs-lisp
(setq emms-source-file-default-directory "~/Music/")
#+end_src
*** IRC (ERC)
Set user information.
#+begin_src elisp :results none
(setq erc-server "localhost"
      erc-nick "chu"
      erc-user-full-name "Chu the Pup")
#+end_src
*** Trash instead of delete
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
#+end_src
*** Org-Mode
**** Custom org-todo-keywords
#+begin_src emacs-lisp
(setq org-todo-keywords
       '((sequence "TODO(t)" "PROJ(p)" "LOOP(r)" "STRT(s)" "WAIT(w)" "HOLD(h)" "HABIT(H)" "IDEA(i)" "|" "DONE(d)" "KILL(k)")
         (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)")
         (sequence "|" "OKAY(o)" "YES(y)" "NO(n)")))
#+end_src
**** Make Org mode look nicer
#+begin_src emacs-lisp
(require 'org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(setq org-pretty-entities t)
#+end_src
**** Custom org capture templates
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq org-capture-templates
        '(("t" "Personal todo" entry
          (file+headline +org-capture-todo-file "Inbox")
          "* [ ] %?\n%i\n%a" :prepend t)
         ("n" "Personal notes" entry
          (file+headline +org-capture-notes-file "Inbox")
          "* %u %?\n%i\n%a" :prepend t)
         ("j" "Journal" entry
          (file+olp+datetree +org-capture-journal-file)
          "* %U %?\n%i\n%a" :prepend t)
         ("p" "Templates for projects")
         ("pt" "Project-local todo" entry
          (file+headline +org-capture-project-todo-file "Inbox")
          "* TODO %?\n%i\n%a" :prepend t)
         ("pn" "Project-local notes" entry
          (file+headline +org-capture-project-notes-file "Inbox")
          "* %U %?\n%i\n%a" :prepend t)
         ("pc" "Project-local changelog" entry
          (file+headline +org-capture-project-changelog-file "Unreleased")
          "* %U %?\n%i\n%a" :prepend t)
         ("o" "Centralized templates for projects")
         ("ot" "Project todo" entry
          #'+org-capture-central-project-todo-file
          "* TODO %?\n %i\n %a" :heading "Tasks" :prepend nil)
         ("on" "Project notes" entry
          #'+org-capture-central-project-notes-file
          "* %U %?\n %i\n %a" :prepend t :heading "Notes")
         ("oc" "Project changelog" entry
          #'+org-capture-central-project-changelog-file
          "* %U %?\n %i\n %a" :prepend t :heading "Changelog")
         ("b" "(web) Bookmark" plain
          (file+headline +org-capture-bookmarks-file "Inbox")
          "*** %?%i%a" :prepend t))))
#+end_src


**** Custom org directories and files :org:

If you use `org' and don't want your org files in the default location below, change `org-directory'. It must be set before org loads!

***** Custom org root directory :org:

The following will vary, so change it to be whatever your org root directory is/what you want it to be.

I use a directory that I sync between computers with a nextcloud server I run but you don't necessarily have to do that.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq org-directory
        (concat
         (getenv "HOME")
        "/nextcloud/documents/org/")))
#+end_src

***** Custom org bookmark directory :org:

The following will vary, so change it to be whatever your bookmarks file is/what you want it to be.

I use a document that I track with org roam but you don't necessarily have to do that.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq +org-capture-bookmarks-file
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/20221004090130-bookmarks.org")))
#+end_src

***** Custom org agenda file :org:

The following will vary, so change it to be whatever your agenda file is/what you want it to be.

I use a document that I track with org roam but you don't necessarily have to do that.

Also, I primarily use a "todo" file rather than an "agenda" file, for agenda ("TODO") items.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq org-agenda-files
        (list
         (concat
          (getenv "HOME")
          "/nextcloud/documents/org/roam/20221004222223-agenda.org"))))
#+end_src

***** Custom org journal file location :org:

You know the gist by now--change this to whatever you want your file to be.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq +org-capture-journal-file
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/20221004222230-journal.org")))
#+end_src

***** Custom org notes file location :org:

You know the gist by now--change this to whatever you want your file to be.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq +org-capture-notes-file
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/20221004222235-notes.org")))
#+end_src

***** Custom org projects file location :org:

You know the gist by now--change this to whatever you want your file to be.

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq +org-capture-projects-file
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/20221004222226-projects.org")))
#+end_src

***** Custom org todo file location :org:

You know the gist by now--change this to whatever you want your file to be.

I primarily use a "todo" file rather than an "agenda" file, for agenda ("TODO") items.

#+begin_src elisp
(with-eval-after-load 'org
  (setq +org-capture-todo-file
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/20221004221829-todo.org")))
#+end_src

***** Org roam v2 directories and files

#+begin_src emacs-lisp
(with-eval-after-load 'org
  (setq org-roam-directory
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/")))
#+end_src

***** Org id custom id location

#+begin_src emacs-lisp
(setq org-id-locations-file
      (concat
       (getenv "HOME")
       "/nextcloud/documents/org/.orgids"))
#+end_src

***** Org-attach custom directory

#+begin_src emacs-lisp
(setq org-attach-id-dir
      (concat
       (getenv "HOME")
       "/nextcloud/documents/org/.attach/"))
#+end_src

***** Org-Cite (oc.el)
****** Org-Cite (oc.el) bibliography location

#+begin_src emacs-lisp
(setq! org-cite-global-bibliography
       (list
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/roam/bib.bib")))
#+end_src

****** Org-Cite (oc.el) CiteProc formatter file directory location

Citation Style Language!

#+begin_src emacs-lisp
(setq org-cite-csl-styles-dir
      (concat
       (getenv "HOME")
       "/nextcloud/documents/org/latex/citeproc-formatters/"))
#+end_src

***** Citar bibliography location

#+begin_src emacs-lisp
(setq citar-bibliography
       (list
        (concat
         (getenv "HOME")
         "/nextcloud/documents/org/bib.bib")))
#+end_src

**** Download/capture for Org mode

#+begin_src emacs-lisp
(with-eval-after-load 'org
(require 'org-download)
(add-hook 'dired-mode-hook 'org-download-enable))
#+end_src

**** Org-download image width attribute tag added automatically when images are downloaded

Set in an attempt to stop images being absolutely HUGE after inlining them in an org document with org-download.

#+begin_src emacs-lisp
(setq org-image-actual-width 500)
#+end_src

**** Load package org-pandoc-import after org loads.

#+begin_src emacs-lisp
(use-package! org-pandoc-import :after org)
#+end_src

