config.org
*** ripgrep "rg" fast search to handle projectile project files

Use the faster searcher to handle project files: ripgrep "rg"

#+begin_src emacs-lisp
(when (and (not (executable-find "fd"))
           (executable-find "rg"))
  (setq projectile-generic-command
        (let ((rg-cmd ""))
          (dolist (dir projectile-globally-ignored-directories)
            (setq rg-cmd (format "%s --glob '!%s'" rg-cmd dir)))
          (setq rg-ignorefile
                (concat "--ignore-file" " "
                        (expand-file-name "rg_ignore" user-emacs-directory)))
          (concat "rg -0 --files --color=never --hidden" rg-cmd " " rg-ignorefile))))
#+end_src

*** Enable active presence on Discord for Emacs

*Note:* This will tell anyone on your Discord your current activity status in Emacs—with a pretty hefty amount of detail as well. If you feel like this violates your sense of privacy, either keep it wrapped with

#+begin_quote
#+begin_example
...
#+end_example
#+end_quote

or just delete it entirely.

#+begin_example emacs-lisp
(elcord-mode)
#+end_example

*** EPG: Letting Emacs query for GPG passwords

Allow Emacs to handle queries for gpg passwords.

Disabled for now.

#+begin_example emacs-lisp
(setf epg-pinentry-mode 'loopback)
(defun pinentry-emacs (desc prompt ok error)
  (let ((str (read-passwd
              (concat (replace-regexp-in-string "%22" "\""
                      (replace-regexp-in-string "%0A" "\n" desc)) prompt ": ")))) str))
#+end_example

*** Periodic saving of recent files list (recentf):

Might be broken, disabling for now.

#+begin_example emacs-lisp
(run-at-time nil (* 5 60) 'recentf-save-list)
#+end_example

*** Ledger
**** Ledger file location defaults

#+begin_src emacs-lisp
(setq ledger-schedule-file "~/nextcloud/documents/ledger/ledger-schedule.ledger")
#+end_src

*** Achievements in Emacs

#+begin_src emacs-lisp
(achievements-mode)
#+end_src

*** Grammarly support in flycheck

#+begin_example emacs-lisp
(with-eval-after-load 'flycheck
  (flycheck-grammarly-setup))
#+end_example

*** Round numbers to N decimals in Elisp

from [[https://gergely.polonkai.eu/blog/2014/10/7/rounding-numbers-to-n-decimals-in-emacs.html][Rounding numbers to N decimals in Emacs]] by Gergely Polonkai

#+begin_src emacs-lisp
(defun get-number-at-point ()
  (interactive)
  (skip-chars-backward "0123456789.-")
  (or (looking-at "[0123456789.-]+")
      (error "No number at point"))
  (string-to-number (match-string 0)))

(defun round-number-at-point-to-decimals (decimal-count)
  (interactive "NDecimal count: ")
  (let ((mult (expt 10 decimal-count)))
    (replace-match (number-to-string
              (/
               (fround
                (*
                 mult
                 (get-number-at-point)))
                mult)))))
#+end_src

* Referenced
** [[https://gergely.polonkai.eu/blog/2014/10/7/rounding-numbers-to-n-decimals-in-emacs.html][Rounding numbers to N decimals in Emacs]] by Gergely Polonkai

** https://blog.lazkani.io/posts/bookmark-with-org-capture/

** https://orgmode.org/manual/Capture-templates.html

** [[https://raw.githubusercontent.com/gilbertw1/emacs-literate-starter/master/emacs.org][DOOM Emacs Literate Config]]

By Gilbert. Thanks, Gilbert.

** [[https://github.com/alphapapa/unpackaged.el#ensure-blank-lines-between-headings-and-before-contents][alphapapa/unpackaged.el: A collection of useful Emacs Lisp code that isn't substantial enough to be packaged]]

This is where the 'unpackaged/org-fix-blank-lines' function was sourced from.

By alphapapa. Thanks, alphapapa.

** [[https://stackoverflow.com/a/35475878/259187][org-archive-subtree-hierarchical.el v0.2]]

By [[https://gist.github.com/kepi/2f4acc3cc93403c75fbba5684c5d852d][Kepi]]. Thanks, Kepi.

*** [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][org-archive-subtree-hierarchical.el v0.1]]

By [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][Florian Adamsky]]. Thanks, Florian Adamsky.
